export const dataArray = [
  {
    id: 'support',
    theme: 'darkgreen',
    coverUrl: '/images/covers/support.svg',
    coverText:
      'Илья, Юра и&nbsp;Саша о&nbsp;доступных способах самоподдержки в&nbsp;начале адаптации',
    slug: 'support',
    content: [
      {
        text: 'Эмиграция&nbsp;&mdash; это очень сложный процесс. Вначале у&nbsp;вас может не&nbsp;быть сил для того, чтобы проявлять любопытство к&nbsp;тому, что есть вокруг. Прежде, чем изучать местную культуру, осваивать территорию и&nbsp;искать людей, будет полезно собрать вещи, которые помогают вам и&nbsp;дают силы. И&nbsp;помните, что если вам плохо, лучше всего обратиться к&nbsp;специалисту.',
        image: '',
        author: '',
      },
      {
        text: 'Мне помогает дневник, записывать туда вообще все свои мысли. Когда было совсем плохо, брал бумажную тетрадь и&nbsp;писал в&nbsp;темноте карандашом в&nbsp;маленькой комнатке-складе, которая была в&nbsp;нашем интернатном общежитии.',
        image: '',
        author: 'Илья',
      },
      {
        text: 'Мне помогает моя семья, когда я&nbsp;дома. И&nbsp;музыка, когда я&nbsp;гуляю один.',
        image: '',
        author: 'Юра',
      },
      {
        text: 'Мне помогает писать о&nbsp;своих чувствах, описывать&nbsp;то, что я&nbsp;ощущаю, или записывать мысли на&nbsp;диктофон, иногда делиться ими с&nbsp;друзьями. Гулять, переписываться, обмениваться переживаниями. Помогают старые любимые сериалы&nbsp;&mdash; родные и&nbsp;тёплые. Животные, которых можно погладить, лечь, прижать к&nbsp;себе и&nbsp;забыть обо всём. Рисунок, образное выражение своих эмоций на&nbsp;листе бумаги тоже очень мне помогает.',
        image: '',
        author: 'Саша',
      },
      {
        text: 'Помогает обустроить приятно комнату, смотреть сериал &laquo;Конь БоДжэк&raquo;. Помогает осваивать что-то новое, придумывать новые приятные правила дома (например, в&nbsp;пятницу готовить вкусный ужин, в&nbsp;выходные смотреть фильмы, играть в&nbsp;настолки).',
        image: '',
        author: 'Полина',
      },
      {
        text: 'Помогает есть шоколад.',
        image: '',
        author: 'Даша',
      },
      {
        text: 'Отвлечься, например, играя в&nbsp;&laquo;Геометри дэшф&raquo; и&nbsp;&laquo;Террарию&raquo;. А&nbsp;ещё всегда помогает высыпаться.',
        image: '',
        author: 'Шимон',
      },
      {
        text: 'Помогает играть в&nbsp;настолки с&nbsp;семьёй. Особенно в&nbsp;монополию по&nbsp;&laquo;Рику и&nbsp;Морти&raquo;.',
        image: '',
        author: 'Игорь',
      },
    ],
  },
  {
    id: 'films',
    theme: 'lightpurple',
    coverUrl: '/images/covers/films.svg',
    coverText:
      'Данина подборка фильмов с&nbsp;ультра-короткими рецензиями в&nbsp;твиттер-формате',
    slug: 'films',
    content: [
      {
        text: 'В&nbsp;жизни уехавших очень много забот. Важно оставить время на&nbsp;отдых и&nbsp;восстановление. Эта подборка фильмов от&nbsp;Дани с&nbsp;его рецензиями поможет погрустить, посмеяться или просто отвлечься.',
        image: '',
        author: '',
      },
      {
        text: 'Историческая военная драма о&nbsp;главном провале англичан во&nbsp;времена второй мировой войны.',
        image: '',
        author: 'Дюнкерк, 2017',
      },
      {
        text: 'Мрачноватый и&nbsp;глубокомысленный фильм на&nbsp;тему одиночества.',
        image: '',
        author: 'Человек — швейцарский нож, 2016',
      },
      {
        text: 'Интересная трагикомическая история о&nbsp;двух противоположностях: темнокожем зеке и&nbsp;богатом парализованном аристократе.',
        image: '',
        author: '1+1, 2011',
      },
      {
        text: 'Весёлый фильм с&nbsp;британской атмосферой криминального Лондона.',
        image: '',
        author: 'Большой куш, 2000',
      },
      {
        text: 'Добрая и&nbsp;душевная история человека, который попал в&nbsp;сложную ситуацию из-за переворота в&nbsp;его родной стране.',
        image: '',
        author: 'Терминал, 2004',
      },
      {
        text: 'Очень запутанная криминальная история про внедрение бандитов в&nbsp;полицию и&nbsp;внедрение полиции в&nbsp;бандитов.',
        image: '',
        author: 'Отступники, 2006',
      },
      {
        text: 'Очень трогательная история про тоталитарное (или авторитарное?) правительство и&nbsp;собак.',
        image: '',
        author: 'Остров собак, 2018',
      },
      {
        text: 'Весёлая история о&nbsp;важности семьи, честности и&nbsp;умении находить радость в&nbsp;простых вещах.',
        image: '',
        author: 'Невероятный мистер Фокс, 2009',
      },
      {
        text: 'Романтическая история о&nbsp;двух влюблённых, которые сбежали из&nbsp;дома для&nbsp;того, чтобы быть вместе.',
        image: '',
        author: 'Королевство полной луны, 2012',
      },
      {
        text: 'Интересная, музыкальная и&nbsp;попросту красивая история про двух влюбленных которые встали перед выбором карьеры и&nbsp;личной жизни.',
        image: '',
        author: 'Ла-ла-ленд, 2016',
      },
      {
        text: 'Чёрная трагикомедия с&nbsp;интересными персонажами, весёлым кровавым экшеном и&nbsp;гениально подобранным музыкальным сопровождением.',
        image: '',
        author: 'Миротворец, 1997',
      },
      {
        text: 'Прекрасно анимированный мультфильм с&nbsp;оригинальным сюжетом и&nbsp;хорошо прописанными персонажами.',
        image: '',
        author: 'Ходячий замок, 2004',
      },
      {
        text: 'Невероятно креативная космическая сказка про борьбу добра со&nbsp;злом. И&nbsp;любовь.',
        image: '',
        author: 'Пятый элемент, 1997',
      },
      {
        text: 'История про&nbsp;то, как товарищ Бендер смог благодаря своей хитрости найти сокровище.',
        image: '',
        author: '12 стульев',
      },
      {
        text: 'Комедийные истории, в&nbsp;которых смешан простой американский юмор и&nbsp;сложный английский.',
        image: '',
        author: 'Кровь и мороженое, 2004–2013',
      },
    ],
  },
  {
    id: 'emotions',
    theme: 'lightyellow',
    coverUrl: '/images/covers/music.svg',
    coverText:
      'Игорь и&nbsp;Эдуард проведут от&nbsp;гнева и&nbsp;тревоги к&nbsp;спокойствию и&nbsp;даже надежде',
    slug: 'emotions',
    content: [
      {
        text: 'Этот плейлист для тех, кто после переезда и&nbsp;всей этой суеты хочет снять напряжение. Сначала идут более жёсткие и&nbsp;сильные треки, дальше&nbsp;&mdash; &laquo;размышляющий тип&raquo; с&nbsp;резким переходом в&nbsp;безумие (Nyan Cat) и&nbsp;под конец&nbsp;&mdash; тонизирующая и&nbsp;мягкая атмосферная музыка.',
        image: '',
        author:
          '<a href="https://youtube.com/playlist?list=PLfklzkefxRVCHo2Yu2lV_VgN9ixTOsmX9" target="_blank">Ссылка на плейлист</a>',
      },
    ],
  },
  {
    id: 'space',
    theme: 'purple',
    coverUrl: '/images/covers/space.svg',
    coverText:
      'Илья, Полина, Дария и&nbsp;Игорь про&nbsp;то, как осваиваться в&nbsp;новой стране',
    slug: 'space',
    content: [
      {
        text: 'Освоение новой страны начинается с&nbsp;освоения её&nbsp;пространства. Если вы&nbsp;начали чувствовать любопытство к&nbsp;внешнему миру, выходите из&nbsp;дома и&nbsp;изучайте его окрестности (можно просто идти в&nbsp;любую сторону по&nbsp;крайней мере 5&nbsp;км). Есть замечательная игра &laquo;Северо-Западный проход&raquo;, по&nbsp;правилам которой нужно каждый раз возвращаться домой новым путём.',
        image: '',
        author: '',
      },
      {
        text: 'Когда был на&nbsp;программе абсорбции, стал выходить в&nbsp;горы. В&nbsp;городе Кармиэль можно попасть в&nbsp;дикую природу за&nbsp;десять минут ходьбы от&nbsp;центра. А&nbsp;там козы, бараны, лисы, черепахи, скорпионы, коровы, деревья. Выходишь из&nbsp;здания интерната и&nbsp;бежишь в&nbsp;каньон. Спустя 4&nbsp;километра оказываешься там, откуда не&nbsp;видно ни&nbsp;одного следа цивилизации. Вокруг простор. Душа как-то зависает, и&nbsp;получается почувствовать, что ты&nbsp;приехал в&nbsp;новую страну.',
        image: '',
        author: 'Илья',
      },
      {
        text: 'Я&nbsp;смотрела, что есть в&nbsp;моём районе (парки, кафешки, магазины, рынок), и&nbsp;постаралась найти место, которое мне по&nbsp;душе. Я&nbsp;нашла кафешку около дома, куда прихожу, когда делаю домашку. Это мой способ выбраться из&nbsp;дома. Ещё можно написать план на&nbsp;месяц: куда вы&nbsp;хотите поехать в&nbsp;своём городе. Купить карту города и&nbsp;отмечать на&nbsp;ней классные места, где уже побывали.',
        image: '',
        author: 'Полина',
      },
      {
        text: 'Я&nbsp;открыл для себя Сафари в&nbsp;Рамат Гане. И&nbsp;просто ходил гулять каждый день.',
        image: '',
        author: 'Игорь',
      },
      {
        text: 'Мне нравится ходить в&nbsp;Яффо. Однажды я&nbsp;была там на&nbsp;испанском концерте вечером. Показалось что я&nbsp;в&nbsp;Питере.',
        image: '',
        author: 'Дария',
      },
    ],
  },
  {
    id: 'contact',
    theme: 'blue',
    coverUrl: '/images/covers/contact.svg',
    coverText:
      'Саша, Игорь и&nbsp;Полина о&nbsp;том, как контактировать с&nbsp;людьми',
    slug: 'contact',
    content: [
      {
        text: 'После знакомства с&nbsp;новым местом вам может стать комфортнее. Следующим шагом будет поиск социального круга.',
        image: '',
        author: '',
      },
      {
        text: 'Мне помогает выйти на&nbsp;улицу, например, в&nbsp;парк, чтобы пообщаться с&nbsp;местными. Поискать в&nbsp;соцсетях мероприятия для русскоговорящих, может, волонтёрские программы или дополнительные занятия.',
        image: '',
        author: 'Полина',
      },
      {
        text: 'Я&nbsp;выходил на&nbsp;баскетбольную площадку около дома и&nbsp;искал контакта с&nbsp;людьми.',
        image: '',
        author: 'Игорь',
      },
      {
        text: 'Я&nbsp;постоянно занимаю себя поисками новых мест, знакомств. Можно волонтёрить, ходить в&nbsp;музеи, учебные учреждения, театры, парки, выставки, лекции, изучать новый город.',
        image: '',
        author: 'Саша',
      },
      {
        text: 'У&nbsp;меня появилась необходимость строить социальный круг с&nbsp;нуля, потому что казалось, что связь со&nbsp;всеми близкими людьми потеряна. Я&nbsp;смог найти людей, только когда накопил энергию на&nbsp;любопытство. Помогло ощущение смелости внутри. Нашел, например, сообщество &laquo;Дикие прогулки&raquo;.',
        image: '',
        author: 'Илья',
      },
      {
        text: 'На&nbsp;первом уроке математики я&nbsp;села к&nbsp;девочке, которая говорит на&nbsp;русском, но&nbsp;она отсела от&nbsp;меня. Какое-то время я&nbsp;сидела одна, но&nbsp;потом она вернулась. Мы&nbsp;стали разговаривать: книги, шоу &laquo;Пацанки&raquo;... Со&nbsp;временем, когда люди находятся рядом, они сближаются. Сейчас мы&nbsp;подружки.',
        image: '',
        author: 'Дария',
      },
    ],
  },
  {
    id: 'talk',
    theme: 'darkgreen',
    coverUrl: '/images/covers/internet.svg',
    coverText: 'Оригинальный способ найти собеседников от&nbsp;Шимона',
    slug: 'talk',
    content: [
      {
        text: '1. Заходишь в&nbsp;браузер.',
        image: '',
        author: '',
      },
      {
        text: '2. Ищешь сочинение по&nbsp;какой-нибудь книге.',
        image: '',
        author: '',
      },
      {
        text: '3. Листаешь вниз и&nbsp;заходишь на&nbsp;какой-нибудь левый сайт.',
        image: '',
        author: '',
      },
      {
        text: '4. Там с&nbsp;50% вероятностью будет чат.',
        image: '',
        author: '',
      },
      {
        text: '5. Пишешь туда &laquo;привет&raquo; и&nbsp;начинаешь общение.',
        image: '',
        author: '',
      },
      {
        text: '6. Говоришь о&nbsp;своей проблеме.',
        image: '',
        author: '',
      },
      {
        text: '7. ГОТОВО! Тебе скорее всего помогли (если это был не&nbsp;токсик 🙂).',
        image: '',
        author: '',
      },
      {
        text: 'Инструкция носит юмористический характер. Редакция не&nbsp;рекомендует повторять совет самостоятельно.',
        image: '',
        author: '',
      },
    ],
  },
  {
    id: 'activity',
    theme: 'lightpurple',
    coverUrl: '/images/covers/whattodo.svg',
    coverText: 'Как переключить себя в&nbsp;конструктивную деятельность',
    slug: 'activity',
    content: [
      {
        text: 'Очень здорово, если после первых советов у&nbsp;вас получится почувствовать себя уютно. Дальше, если есть свободное от&nbsp;решения бытовых проблем время, можно начинать искать какие-то дела, чтобы погрузиться в&nbsp;жизнь на&nbsp;новом месте.',
        image: '',
        author: '',
      },
      {
        text: 'Я&nbsp;стал помогать сообществу, которое нашёл. Преподавать математику.',
        image: '',
        author: 'Илья',
      },
      {
        text: 'Самым первым был театр. В&nbsp;России у&nbsp;меня не&nbsp;было времени им&nbsp;заниматься, но&nbsp;после переезда в&nbsp;Израиль, у&nbsp;меня появилось больше свободного времени на&nbsp;то, что мне нравится.',
        image: '',
        author: 'Саша',
      },
      {
        text: 'Мне помогает волейбол и&nbsp;&laquo;Дикие прогулки&raquo;.',
        image: '',
        author: 'Майя',
      },
      {
        text: 'Мне помогло гулять по&nbsp;кибуцу, наслаждаться природой. Потом часами сидеть в&nbsp;МВД и&nbsp;у&nbsp;адвокатов и&nbsp;говорить на&nbsp;смеси всех языков, какие я&nbsp;знаю.',
        image: '',
        author: 'Кот',
      },
      {
        text: 'Иногда я&nbsp;решаю маленькие бытовые проблемы для того, чтобы почувствовать себя уютнее.',
        image: '',
        author: 'Игорь',
      },
      {
        text: 'Я&nbsp;нашла себе небольшую работу в&nbsp;агенстве по&nbsp;недвижимости для репатриантов.',
        image: '',
        author: 'Дария',
      },
    ],
  },
  {
    id: 'change',
    theme: 'lightyellow',
    coverUrl: '/images/covers/local.svg',
    coverText:
      'Что делать для того, чтобы ещё лучше понимать местную обстановку',
    slug: 'change',
    content: [
      {
        text: 'Когда в&nbsp;новой стране вы&nbsp;нашли своё сообщество, свои места и&nbsp;какое-то занятие, здорово, если проснётся любопытство к&nbsp;культуре, традициям, местным жителям. Собрали свои советы о&nbsp;том, что помогает интегрироваться.',
        image: '',
        author: '',
      },
      {
        text: 'Чаще говорить на&nbsp;местном языке, спрашивать куда идти, сколько стоит, не&nbsp;бояться попросить помощи с&nbsp;языком.',
        image: '',
        author: 'Полина',
      },
      {
        text: 'Ходить в&nbsp;ульпан (учебное заведение или школа для изучения иврита) и&nbsp;в&nbsp;школу, это правда помогает. Подписаться на&nbsp;кучу бесплатных пабликов в&nbsp;фейсбуке.',
        image: '',
        author: 'Игорь',
      },
      {
        text: 'Я&nbsp;пошёл в&nbsp;израильский походный кружок.',
        image: '',
        author: 'Илья',
      },
      {
        text: 'Ходить знакомиться на&nbsp;детских площадках. Я&nbsp;так устроилась через маму одной девочки в&nbsp;скауты (активность после школы) в&nbsp;группу, где участники&nbsp;&mdash; одни израильтяне, и&nbsp;никто не&nbsp;знает русского языка. Это было круто, мы&nbsp;пытались общаться на&nbsp;английском!',
        image: '',
        author: 'Даша',
      },
    ],
  },
  {
    id: 'advice',
    theme: 'purple',
    coverUrl: '/images/covers/advice.svg',
    coverText: 'Мудрость Ализы, Ильи и&nbsp;Аси в&nbsp;четырёх абзацах',
    slug: 'advice',
    content: [
      {
        text: 'А&nbsp;вот несколько наших советов.',
        image: '',
        author: '',
      },
      {
        text: '(1) Вообще, я&nbsp;бы посоветовала людям, особенно религиозным, не&nbsp;впадать в&nbsp;мечты. Современный Израиль&nbsp;&mdash; это не&nbsp;святая земля, текущая молоком и&nbsp;мёдом, это такая&nbsp;же капиталистическая страна, как и&nbsp;все остальные. Людям стоит оставаться начеку и&nbsp;понимать, что люди здесь не&nbsp;какие-то особенные.',
        image: '',
        author: 'Ализа',
      },
      {
        text: '(2) Если человек приезжает в&nbsp;любую страну, которую идеализировал, с&nbsp;уверенностью могу сказать&nbsp;&mdash; его ждут очень неприятные времена. В&nbsp;пятом классе мое ментальное состояние было &laquo;оторви и&nbsp;выкинь&raquo;.',
        image: '',
        author: 'Ализа',
      },
      {
        text: '(1) В&nbsp;Израиле очень много удобных туристических троп&nbsp;&mdash; ходите в&nbsp;походы.',
        image: '',
        author: 'Илья',
      },
      {
        text: '(2) Есть закон, согласно которому в каждом ресторане вам должны дать воду бесплатно, если вы попросите. Пейте больше воды!',
        image: '',
        author: 'Илья',
      },
      {
        text: '(1) Я&nbsp;вам советую попробовать израильскую еду, потому что вряд&nbsp;ли она есть ещё в&nbsp;каких-то странах кроме Израиля.',
        image: '',
        author: 'Ася',
      },
      {
        text: '(2) Если вы&nbsp;хотите добраться до&nbsp;какого-то неблизкого места либо берите такси, либо планируйте свой путь заранее, потому что можете не&nbsp;доехать вовремя или вообще не&nbsp;приехать туда, куда планировали. Автобусы часто подводят, а&nbsp;израильтяне не&nbsp;любят когда люди опаздывают.',
        image: '',
        author: 'Ася',
      },
    ],
  },
];
