export const dataArray = [
  {
    id: "support",
    theme: "darkgreen",
    coverUrl: "/images/covers/support.svg",
    coverText:
      "Илья, Юра и Саша о доступных способах самоподдержки в начале адаптации",
    slug: "support",
    content: [
      {
        text: "Эмиграция — это очень сложный процесс. Вначале у вас может не быть сил для того, чтобы проявлять любопытство к тому, что есть вокруг. Прежде, чем изучать местную культуру, осваивать территорию и искать людей, будет полезно собрать вещи, которые помогают вам и дают силы. И помните, что если вам плохо, лучше всего обратиться к специалисту.",
        image: "",
        author: "",
      },
      {
        text: "Мне помогает дневник, записывать туда вообще все свои мысли. Когда было совсем плохо, брал бумажную тетрадь и писал в темноте карандашом в маленькой комнатке-складе, которая была в нашем интернатном общежитии.",
        image: "",
        author: "Илья",
      },
      {
        text: "Мне помогает моя семья, когда я дома. И музыка, когда я гуляю один.",
        image: "",
        author: "Юра",
      },
      {
        text: "Мне помогает писать о своих чувствах, описывать то, что я ощущаю, или записывать мысли на диктофон, иногда делиться ими с друзьями. Гулять, переписываться, обмениваться переживаниями. Помогают старые любимые сериалы — родные и тёплые. Животные, которых можно погладить, лечь, прижать к себе и забыть обо всём. Рисунок, образное выражение своих эмоций на листе бумаги тоже очень мне помогает.",
        image: "",
        author: "Саша",
      },
      {
        text: "Помогает обустроить приятно комнату, смотреть сериал «Конь БоДжэк». Помогает осваивать что-то новое, придумывать новые приятные правила дома (например, в пятницу готовить вкусный ужин, в выходные смотреть фильмы, играть в настолки).",
        image: "",
        author: "Полина",
      },
      {
        text: "Помогает есть шоколад.",
        image: "",
        author: "Даша",
      },
      {
        text: "Отвлечься, например, играя в «Геометри дэшф» и «Террарию». А ещё всегда помогает высыпаться.",
        image: "",
        author: "Шимон",
      },
      {
        text: "Помогает играть в настолки с семьёй. Особенно в монополию по «Рику и Морти».",
        image: "",
        author: "Игорь",
      },
    ],
  },
  {
    id: "films",
    theme: "lightpurple",
    coverUrl: "/images/covers/films.svg",
    coverText:
      "Данина подборка фильмов с ультра-короткими рецензиями в твиттер-формате",
    slug: "films",
    content: [
      {
        text: "В жизни уехавших очень много забот. Важно оставить время на отдых и восстановление. Эта подборка фильмов от Дани с его рецензиями поможет погрустить, посмеяться или просто отвлечься.",
        image: "",
        author: "",
      },
      {
        text: "Историческая военная драма о главном провале англичан во времена второй мировой войны.",
        image: "",
        author: "Дюнкерк, 2017",
      },
      {
        text: "Мрачноватый и глубокомысленный фильм на тему одиночества.",
        image: "",
        author: "Человек — швейцарский нож, 2016",
      },
      {
        text: "Интересная трагикомическая история о двух противоположностях: темнокожем зеке и богатом парализованном аристократе.",
        image: "",
        author: "1+1, 2011",
      },
      {
        text: "Весёлый фильм с британской атмосферой криминального Лондона.",
        image: "",
        author: "Большой куш, 2000",
      },
      {
        text: "Добрая и душевная история человека, который попал в сложную ситуацию из-за переворота в его родной стране.",
        image: "",
        author: "Терминал, 2004",
      },
      {
        text: "Очень запутанная криминальная история про внедрение бандитов в полицию и внедрение полиции в бандитов.",
        image: "",
        author: "Отступники, 2006",
      },
      {
        text: "Очень трогательная история про тоталитарное (или авторитарное?) правительство и собак.",
        image: "",
        author: "Остров собак, 2018",
      },
      {
        text: "Весёлая история о важности семьи, честности и умении находить радость в простых вещах.",
        image: "",
        author: "Невероятный мистер Фокс, 2009",
      },
      {
        text: "Интересная, музыкальная и попросту красивая история про двух влюблённых, которые встали перед выбором между карьерой и личной жизнью.",
        image: "",
        author: "Королевство полной луны, 2012",
      },
      {
        text: "Интересная, музыкальная и попросту красивая история про двух влюбленных которые встали перед выбором карьеры и личной жизни.",
        image: "",
        author: "Ла-ла-ленд, 2016",
      },
      {
        text: "Чёрная трагикомедия с интересными персонажами, весёлым кровавым экшеном и гениально подобранным музыкальным сопровождением.",
        image: "",
        author: "Миротворец, 1997",
      },
      {
        text: "Прекрасно анимированный мультфильм с оригинальным сюжетом и хорошо прописанными персонажами.",
        image: "",
        author: "Ходячий замок, 2004",
      },
      {
        text: "Невероятно креативная космическая сказка про борьбу добра со злом. И любовь.",
        image: "",
        author: "Пятый элемент, 1997",
      },
      {
        text: "История про то, как товарищ Бендер смог благодаря своей хитрости найти сокровище.",
        image: "",
        author: "12 стульев",
      },
      {
        text: "Комедийные истории, в которых смешан простой американский юмор и сложный английский.",
        image: "",
        author: "Кровь и мороженое, 2004–2013",
      },
    ],
  },
  {
    id: "emotions",
    theme: "lightyellow",
    coverUrl: "/images/covers/music.svg",
    coverText:
      "Игорь и Эдуард проведут от гнева и тревоги к спокойствию и даже надежде",
    slug: "emotions",
    content: [
      {
        text: "Этот плейлист для тех, кто после переезда и всей этой суеты хочет снять напряжение. Сначала идут более жёсткие и сильные треки, дальше — «размышляющий тип» с резким переходом в безумие (Nyan Cat) и под конец — тонизирующая и мягкая атмосферная музыка.",
        image: "",
        author: '<a href="#">Ссылка на плейлист</a>',
      },
    ],
  },
  {
    id: "space",
    theme: "purple",
    coverUrl: "/images/covers/space.svg",
    coverText:
      "Илья, Полина, Дария и Игорь про то, как осваиваться в новой стране",
    slug: "space",
    content: [
      {
        text: "Освоение новой страны начинается с освоения её пространства. Если вы начали чувствовать любопытство к внешнему миру, выходите из дома и изучайте его окрестности (можно просто идти в любую сторону по крайней мере 5 км). Есть замечательная игра «Северо-Западный проход», по правилам которой нужно каждый раз возвращаться домой новым путём.",
        image: "",
        author: "",
      },
      {
        text: "Когда был на программе абсорбции, стал выходить в горы. В городе Кармиэль можно попасть в дикую природу за десять минут ходьбы от центра. А там козы, бараны, лисы, черепахи, скорпионы, коровы, деревья. Выходишь из здания интерната и бежишь в каньон. Спустя 4 километра оказываешься там, откуда не видно ни одного следа цивилизации. Вокруг простор. Душа как-то зависает, и получается почувствовать, что ты приехал в новую страну.",
        image: "",
        author: "Илья",
      },
      {
        text: "Я смотрела, что есть в моём районе (парки, кафешки, магазины, рынок), и постаралась найти место, которое мне по душе. Я нашла кафешку около дома, куда прихожу, когда делаю домашку. Это мой способ выбраться из дома. Ещё можно написать план на месяц: куда вы хотите поехать в своём городе. Купить карту города и отмечать на ней классные места, где уже побывали.",
        image: "",
        author: "Полина",
      },
      {
        text: "Я открыл для себя Сафари в Рамат Гане. И просто ходил гулять каждый день.",
        image: "",
        author: "Игорь",
      },
      {
        text: "Мне нравится ходить в Яффо. Однажды я была там на испанском концерте вечером. Показалось что я в Питере.",
        image: "",
        author: "Дария",
      },
    ],
  },
  {
    id: "contact",
    theme: "blue",
    coverUrl: "/images/covers/contact.svg",
    coverText: "Саша, Игорь и Полина о том, как контактировать с людьми",
    slug: "contact",
    content: [
      {
        text: "После знакомства с новым местом вам может стать комфортнее. Следующим шагом будет поиск социального круга.",
        image: "",
        author: "",
      },
      {
        text: "Мне помогает выйти на улицу, например, в парк, чтобы пообщаться с местными. Поискать в соцсетях мероприятия для русскоговорящих, может, волонтёрские программы или дополнительные занятия.",
        image: "",
        author: "Полина",
      },
      {
        text: "Я выходил на баскетбольную площадку около дома и искал контакта с людьми.",
        image: "",
        author: "Игорь",
      },
      {
        text: "Я постоянно занимаю себя поисками новых мест, знакомств. Можно волонтёрить, ходить в музеи, учебные учреждения, театры, парки, выставки, лекции, изучать новый город.",
        image: "",
        author: "Саша",
      },
      {
        text: "У меня появилась необходимость строить социальный круг с нуля, потому что казалось, что связь со всеми близкими людьми потеряна. Я смог найти людей, только когда накопил энергию на любопытство. Помогло ощущение смелости внутри. Нашел, например, сообщество «Дикие прогулки».",
        image: "",
        author: "Илья",
      },
      {
        text: "На первом уроке математики я села к девочке, которая говорит на русском, но она отсела от меня. Какое-то время я сидела одна, но потом она вернулась. Мы стали разговаривать: книги, шоу «Пацанки»... Со временем, когда люди находятся рядом, они сближаются. Сейчас мы подружки.",
        image: "",
        author: "Дария",
      },
    ],
  },
  {
    id: "talk",
    theme: "darkgreen",
    coverUrl: "/images/covers/internet.svg",
    coverText: "Оригинальный способ найти собеседников от Шимона",
    slug: "talk",
    content: [
      {
        text: "1. Заходишь в браузер.",
        image: "",
        author: "",
      },
      {
        text: "2. Ищешь сочинение по какой-нибудь книге.",
        image: "",
        author: "",
      },
      {
        text: "3. Листаешь вниз и заходишь на какой-нибудь левый сайт.",
        image: "",
        author: "",
      },
      {
        text: "4. Там с 50% вероятностью будет чат.",
        image: "",
        author: "",
      },
      {
        text: "5. Пишешь туда «привет» и начинаешь общение.",
        image: "",
        author: "",
      },
      {
        text: "6. Говоришь о своей проблеме.",
        image: "",
        author: "",
      },
      {
        text: "7. ГОТОВО! Тебе скорее всего помогли (если это был не токсик 🙂).",
        image: "",
        author: "",
      },
      {
        text: "Инструкция носит юмористический характер. Редакция не рекомендует повторять совет самостоятельно.",
        image: "",
        author: "",
      },
    ],
  },
  {
    id: "activity",
    theme: "lightpurple",
    coverUrl: "/images/covers/whattodo.svg",
    coverText: "Как переключить себя в конструктивную деятельность",
    slug: "activity",
    content: [
      {
        text: "Очень здорово, если после первых советов у вас получится почувствовать себя уютно. Дальше, если есть свободное от решения бытовых проблем время, можно начинать искать какие-то дела, чтобы погрузиться в жизнь на новом месте.",
        image: "",
        author: "",
      },
      {
        text: "Я стал помогать сообществу, которое нашёл. Преподавать математику.",
        image: "",
        author: "Илья",
      },
      {
        text: "Самым первым был театр. В России у меня не было времени им заниматься, но после переезда в Израиль, у меня появилось больше свободного времени на то, что мне нравится.",
        image: "",
        author: "Саша",
      },
      {
        text: "Мне помогает волейбол и «Дикие прогулки».",
        image: "",
        author: "Майя",
      },
      {
        text: "Мне помогло гулять по кибуцу, наслаждаться природой. Потом часами сидеть в МВД и у адвокатов и говорить на смеси всех языков, какие я знаю.",
        image: "",
        author: "Кот",
      },
      {
        text: "Иногда я решаю маленькие бытовые проблемы для того, чтобы почувствовать себя уютнее.",
        image: "",
        author: "Игорь",
      },
      {
        text: "Я нашла себе небольшую работу в агенстве по недвижимости для репатриантов.",
        image: "",
        author: "Дария",
      },
    ],
  },
  {
    id: "change",
    theme: "lightyellow",
    coverUrl: "/images/covers/local.svg",
    coverText:
      "Что делать для того, чтобы ещё лучше понимать местную обстановку",
    slug: "change",
    content: [
      {
        text: "Когда в новой стране вы нашли своё сообщество, свои места и какое-то занятие, здорово, если проснётся любопытство к культуре, традициям, местным жителям. Собрали свои советы о том, что помогает интегрироваться.",
        image: "",
        author: "",
      },
      {
        text: "Чаще говорить на местном языке, спрашивать куда идти, сколько стоит, не бояться попросить помощи с языком.",
        image: "",
        author: "Полина",
      },
      {
        text: "Ходить в ульпан (учебное заведение или школа для изучения иврита) и в школу, это правда помогает. Подписаться на кучу бесплатных пабликов в фейсбуке.",
        image: "",
        author: "Игорь",
      },
      {
        text: "Я пошёл в израильский походный кружок. ",
        image: "",
        author: "Илья",
      },
      {
        text: "Ходить знакомиться на детских площадках. Я так устроилась через маму одной девочки в скауты (активность после школы) в группу, где участники — одни израильтяне, и никто не знает русского языка. Это было круто, мы пытались общаться на английском!",
        image: "",
        author: "Даша",
      },
    ],
  },
  {
    id: "advice",
    theme: "purple",
    coverUrl: "/images/covers/advice.svg",
    coverText: "Мудрость Ализы и Ильи в четырёх абзацах",
    slug: "advice",
    content: [
      {
        text: "А вот несколько наших советов.",
        image: "",
        author: "",
      },
      {
        text: "(1) Вообще, я бы посоветовала людям, особенно религиозным, не впадать в мечты. Современный Израиль — это не святая земля, текущая молоком и мёдом, это такая же капиталистическая страна, как и все остальные. Людям стоит оставаться начеку и понимать, что люди здесь не какие-то особенные.",
        image: "",
        author: "Ализа",
      },
      {
        text: "(2) Если человек приезжает в любую страну, которую идеализировал, с уверенностью могу сказать — его ждут очень неприятные времена. В пятом классе мое ментальное состояние было «оторви и выкинь».",
        image: "",
        author: "Ализа",
      },
      {
        text: "(1) В Израиле очень много удобных туристических троп — ходите в походы.",
        image: "",
        author: "Илья",
      },
      {
        text: "(2) Есть закон, согласно которому в каждом ресторане вам должны дать воду бесплатно, если вы попросите. Пейте больше воды!",
        image: "",
        author: "Илья",
      },
      {
        text: "(1) Я вам советую попробовать израильскую еду, потому что вряд ли она есть ещё в каких-то странах кроме Израиля.",
        image: "",
        author: "Ася",
      },
      {
        text: "(2) Если вы хотите добраться до какого-то неблизкого места либо берите такси, либо планируйте свой путь заранее, потому что можете не доехать вовремя или вообще не приехать туда, куда планировали. Автобусы часто подводят, а израильтяне не любят когда люди опаздывают.",
        image: "",
        author: "Ася",
      },
    ],
  },
];
