const dataArray = [
  {
    id: "support",
    theme: "darkgreen",
    coverUrl: "/images/covers/support.svg",
    coverText:
      "Илья, Юра и Саша о доступных способах самоподдержки в начале адаптации",
    slug: "support",
    content: [
      {
        text: "Эмиграция — это очень сложный процесс. Вначале у вас может не быть сил для того, чтобы проявлять любопытство к тому что есть вокруг. Прежде чем изучать местную культуру, осваивать территорию и искать людей, будет полезно собрать вещи, которые помогают вам и дают силы. И помните, что если вам плохо, лучше всего обратиться к специалисту.",
        image: "",
        author: "",
      },
      {
        text: "Мне помогает дневник, записывать вообще все свои мысли. Когда было совсем плохо брал бумажную тетрадь и писал в темноте карандашом в маленькой комнатке складе которая была в нашем интернатном общежитии. Мне помогает дневник, записывать вообще все свои мысли. Когда было совсем плохо брал бумажную тетрадь и писал в темноте карандашом в маленькой комнатке складе которая была в нашем интернатном общежитии.",
        image: "",
        author: "Илья",
      },
      {
        text: "Мне помогает моя семья, когда я дома. И музыка, когда я гуляю один.",
        image: "",
        author: "Юра",
      },
      {
        text: "Мне помогает писать о своих чувствах, описывать то что я ощущаю или записывать мысли на диктофон, иногда делится ими с друзьями, встречатся с ними, гулять, переписыватся с друзьями из дома, к которым всегда можно обратиться, всё рассказать и поделится. старые любимые сериалы - - родные и тёплые. Животные которых можно погладить, лечь, прижать их к себе и забыть обо всём. Рисунок, опять же вырисовка и передавание своих эмоций на листе бумаги, - - очень мне помогают.",
        image: "",
        author: "Саша",
      },
    ],
  },
  {
    id: "films",
    theme: "lightpurple",
    coverUrl: "/images/covers/films.svg",
    coverText:
      "Данина подборка фильмов с ультра-короткими рецензиями в твиттер-формате",
    slug: "films",
    content: [
      {
        text: "В жизни уехавшего очень много забот. Важно оставить время на отдых и восстановление. Эта подбора фильмов от Дани с его рецензиями поможет погрустить, посмеяться или просто отвлечься.",
        image: "",
        author: "",
      },
      {
        text: "Историческая военная драма о главном провале англичан во времена второй мировой войны.",
        image: "",
        author: "Дюнкерк, 2017",
      },
      {
        text: "Мрачноватый и глубокомысленный фильм на тему одиночества.",
        image: "",
        author: "Человек — швейцарский нож, 2016",
      },
      {
        text: "Интересная трагикомическая история о двух противоположностях черном зеке и богатом парализованном аристократе.",
        image: "",
        author: "1+1, 2011",
      },
      {
        text: "Веселый фильм с британской атмосферой криминального Лондона.",
        image: "",
        author: "Большой куш, 2000",
      },
      {
        text: "Добрая и душевная история человека который попал в сложную ситуацию из-за переворота в его родной стране.",
        image: "",
        author: "Терминал, 2004",
      },
      {
        text: "Очень запутанная криминальная история про внедрение бандитов в полицию и внедрение полиции в бандитов.",
        image: "",
        author: "Отступники, 2006",
      },
      {
        text: "Очень трогательная история про тоталитарное (или авторитарное?) правительство и собак.",
        image: "",
        author: "Остров собак, 2018",
      },
      {
        text: "Весёлая история о важности семьи, честности и умении находить радость в простых вещах.",
        image: "",
        author: "Невероятный мистер Фокс, 2009",
      },
      {
        text: "Романтическая история о двух влюбленных, которые сбежали из дома, для того, чтобы быть вместе.",
        image: "",
        author: "Королевство полной луны, 2012",
      },
      {
        text: "Интересная, музыкальная и попросту красивая история про двух влюбленных которые встали перед выбором карьеры и личной жизни.",
        image: "",
        author: "Ла-ла-ленд, 2016",
      },
      {
        text: "Черная трагикомедия с интересными персонажами, весёлым, кровавым экшеном и гениально подобранным музыкальным сопровождением.",
        image: "",
        author: "Миротворец, 1997",
      },
      {
        text: "Прекрасно анимированый мультфильм с оригинальным сюжетом и хорошо прописанными персонажами.",
        image: "",
        author: "Ходячий замок, 2004",
      },
      {
        text: "Невероятно креативная космическая сказка про борьбу добра со злом. И любовь.",
        image: "",
        author: "Пятый элемент, 1997",
      },
      {
        text: "История про то, как товарищ Бендер смог благодаря своей хитрости найти сокровище.",
        image: "",
        author: "12 стульев",
      },
      {
        text: "Комедийные истории в которой смешан простой американский юмор и сложный английский.",
        image: "",
        author: "Кровь и мороженое, 2004–2013",
      },
    ],
  },
  {
    id: "emotions",
    theme: "lightyellow",
    coverUrl: "/images/covers/music.svg",
    coverText:
      "Игорь и Эдуард проведут от гнева и тревоги к спокойствию и даже надежде",
    slug: "emotions",
    content: [
      {
        text: "Этот плейлист для тех кто после переезда и всей этой суеты хочет снять напряжение. Сначала идут более жёсткие и сильные треки, переходя в более размышляющий тип с резким переходом в безумие (Nyan Cat) и под конец — в тонизирующую и мягкую атмосферную музыку.",
        image: "",
        author: '<a href="#">Ссылка на плейлист</a>',
      },
    ],
  },
  {
    id: "space",
    theme: "purple",
    coverUrl: "/images/covers/space.svg",
    coverText:
      "Илья, Полина, Дария и Игорь про то, как осваиваться в новой стране",
    slug: "space",
    content: [
      {
        text: "Освоение новой страны начинается с освоения её пространства. Если вы начали чувствовать любопытство к внешнему миру, выйдите из дома и сходите в каждую сторону хотя бы на пять километров. Есть замечательная игра «Северо-Западный проход», по правилам которой нужно каждый раз возвращаться домой новым путем.",
        image: "",
        author: "",
      },
      {
        text: "Ещё когда был на программе абсорбции, стал выходить в горы. В городе Кармиэль можно попасть в дикую природу за десять минут ходьбы от центра города. А там, козы, бараны, лисы, черепахи, скорпионы, коровы, деревья. Выходишь из здания-интерната и бежишь в каньон, и вот спустя 4 километра вдруг оказываешься в месте из которого не видно ни одного домика, ни одного следа цивилизации, и огромный простор. Душа как-то зависает и получается действительно почувствовать что ты приехал в новую страну.",
        image: "",
        author: "Илья",
      },
      {
        text: "Посмотреть, что есть в вашем районе (парки, кафешки, магазины, рынок), постарайтесь найти место, которое вам по душе. Я нашла кафешку около дома, куда прихожу, когда делаю домашку, тогда я выбираюсь из дома. Написать план на месяц, куда вы хотите поехать в своем городе. Купить карту города и отмечайте классные места, где бывали.",
        image: "",
        author: "Полина",
      },
      {
        text: "Открыл сафари в Рамат-Гане.",
        image: "",
        author: "Игорь",
      },
      {
        text: "Мне нравится ходить в Яффо.",
        image: "",
        author: "Дария",
      },
    ],
  },
  {
    id: "contact",
    theme: "blue",
    coverUrl: "/images/covers/contact.svg",
    coverText: "Саша, Игорь и Полина о том, как контактировать с людьми",
    slug: "contact",
    content: [
      {
        text: "После знакомства с новым местом вам может стать комфортнее. Следующим шагом будет поиск социального круга.",
        image: "",
        author: "",
      },
      {
        text: "Выйти на улицу, например в парк, чтобы пообщаться с местными; Поискать в соцсетях мероприятия для русскоговорящих, может волонтерские программы или дополнительные занятия.",
        image: "",
        author: "Полина",
      },
      {
        text: "Я выходил на баскетбольную площадку около дома и искал контакта с людьми.",
        image: "",
        author: "Игорь",
      },
      {
        text: "Постоянно занимать себя поисками новых мест, знакомств, волонтёрить, ходить в музеи, учебные учреждения, театры, парки, выставки, лекции, изучать новый город.",
        image: "",
        author: "Саша",
      },
    ],
  },
  {
    id: "talk",
    theme: "darkgreen",
    coverUrl: "/images/covers/internet.svg",
    coverText: "Оригинальный способ найти собеседников от Шимона",
    slug: "talk",
    content: [
      {
        text: "1. Заходишь в браузер.",
        image: "",
        author: "",
      },
      {
        text: "2. Ищешь сочинение по «какой-нибудь книге».",
        image: "",
        author: "",
      },
      {
        text: "3. Листаешь вниз и заходишь на какой-нибудь левый сайт.",
        image: "",
        author: "",
      },
      {
        text: "4. Там с 50% вероятностью будет чат.",
        image: "",
        author: "",
      },
      {
        text: "5. Пишешь туда «привет» и начинаешь общение.",
        image: "",
        author: "",
      },
      {
        text: "6. Говоришь о своей проблеме.",
        image: "",
        author: "",
      },
      {
        text: "7. ГОТОВО! Тебе скорее всего помогли (если это был не токсик 🙂).",
        image: "",
        author: "",
      },
    ],
  },
  {
    id: "activity",
    theme: "lightpurple",
    coverUrl: "/images/covers/whattodo.svg",
    coverText: "Как переключить себя в конструктивную деятельность",
    slug: "activity",
    content: [
      {
        text: "Очень здорово, если после этого у вас получится почувствовать себя уютно. И тогда можно начинать искать какую-то деятельность (если у вас есть свободное время от решения бытовых проблем).",
        image: "",
        author: "",
      },
      {
        text: "Самым первым был театр. в России у меня не было времени им заниматься, но после переезда в Израиль, у меня появилось больше свободного времени на то что мне нравится.",
        image: "",
        author: "Саша",
      },
    ],
  },
  {
    id: "change",
    theme: "lightyellow",
    coverUrl: "/images/covers/local.svg",
    coverText:
      "Что делать для того, чтобы ещё лучше понимать местную обстановку",
    slug: "change",
    content: [
      {
        text: "Когда в новой стране вы нашли своё сообщество, свои места и какое-то занятие, у вас должно хватить силы на проявление любопытства ко внутренней культуре, традициям, сложившемуся здесь сообществу.",
        image: "",
        author: "",
      },
      {
        text: "Ходить знакомиться на детских площадках, я так устроилась через маму одной девочке в скауты (активность после школы, может видели подростки в форме ходят) в группу где одни израильтяне и никто не знал русского, это было круто, мы пытались общаться на английском.",
        image: "",
        author: "Даша",
      },
    ],
  },
  {
    id: "advice",
    theme: "purple",
    coverUrl: "/images/covers/advice.svg",
    coverText: "Мудрость Ализы и Ильи в четырёх абзацах",
    slug: "advice",
    content: [
      {
        text: "А вот несколько наших советов.",
        image: "",
        author: "",
      },
      {
        text: "(1) Вообще, я бы посоветовала людям, особенно религиозным, не впадать в мечты. Современный Израиль — это не святая земля, текущая молоком и мёдом, это такая же капиталистическая страна, как и все остальные. Людям стоит оставаться начеку, и понимать, что люди здесь не какие-то особенные.",
        image: "",
        author: "Ализа",
      },
      {
        text: "(2) Если человек приезжает в любую другую страну, которую идеализировал — с уверенностью могу сказать — его ждут очень неприятные времена. В пятом классе мое ментальное состояние было «оторви и выкинь».",
        image: "",
        author: "Ализа",
      },
    ],
  },
];

const cards = document.querySelectorAll(".clickable-card");
const popupTmp = document.querySelector(".slider-popup-template");
const slideTemplate = document.querySelector(".card-slide-tmp");
const baseURL = "https://shalom.kruzhok.io/";

let isOpened = false;

cards.forEach((item) => {
  let popup;
  item.onclick = () => {
    document.body.classList.add("blured");
    const dataForClickedCard = findWithId(dataArray, item.id);
    generateSlider(popupTmp, dataForClickedCard, document.body);
    popup = document.querySelector(".cards-popup");
    dataForClickedCard.content.forEach((item) => {
      generateSlide(
        slideTemplate,
        item,
        popup.querySelector(".swiper-wrapper")
      );
    });

    popup.onclick = (e) => {
      if (e.target.contains(document.querySelector(".cards-popup-slider"))) {
        document.body.classList.remove("blured");
        popup.remove();
      }
    };
    document.querySelector(".popup-close-button").onclick = () => {
      document.body.classList.remove("blured");
      popup.remove();
    };
    initializeSwiper();
    // Управляем копированием адреса по ссылке на кнопку шера
    const shareLinkButton = popup.querySelector(".link-share");
    shareLinkButton.onclick = function () {
      navigator.clipboard.writeText(shareLinkButton.getAttribute("data-href"));
      const copyTooltip = popup.querySelector(".popup-tooltip");
      copyTooltip.style.opacity = "1";
      copyTooltip.setAttribute("aria-hidden", "false");
      setTimeout(() => {
        copyTooltip.style.opacity = "0";
        copyTooltip.setAttribute("aria-hidden", "true");
      }, 3000);
    };
  };
});

function findWithId(data, id) {
  const item = data.find((el) => {
    return el.id === id;
  });
  return item;
}

function generateSlider(tmp, obj, parent) {
  const node = tmp.content.cloneNode(true);
  node.querySelector(".card-slide-illustration").src = obj.coverUrl;
  node
    .querySelector(".card-slide-illustration")
    .setAttribute("alt", obj.coverText);
  node.querySelector(".cards-popup-slider").classList.add(`theme-${obj.theme}`);
  const encodedShareURL = encodeURI(`${baseURL}${obj.slug}.html`);
  node
    .querySelector(".fb-share")
    .setAttribute(
      "href",
      `https://www.facebook.com/sharer/sharer.php?u=${encodedShareURL}`
    );
  node
    .querySelector(".tg-share")
    .setAttribute(
      "href",
      `https://t.me/share/url?url=${encodedShareURL}&text=${encodeURI(
        `Shalom Olam. ${obj.coverText}`
      )}`
    );
  node
    .querySelector(".tw-share")
    .setAttribute(
      "href",
      `https://twitter.com/intent/tweet?url=${encodedShareURL}&text=${encodeURI(
        `Shalom Olam. ${obj.coverText}`
      )}`
    );
  node.querySelector(".link-share").setAttribute("data-href", encodedShareURL);
  parent.append(node);
}

function generateSlide(tmp, obj, slider) {
  const node = tmp.content.cloneNode(true);
  node.querySelector(".card-slide-content").innerHTML = obj.text;
  node.querySelector(".card-slide-author").innerHTML = obj.author;
  slider.append(node);
}

function initializeSwiper() {
  const swiper = new Swiper(".swiper", {
    // Optional parameters
    direction: "horizontal",
    loop: true,

    // If we need pagination
    pagination: {
      el: ".swiper-pagination",
    },

    keyboard: {
      enabled: true,
    },

    // Navigation arrows
    navigation: {
      nextEl: ".swiper-button-next",
      prevEl: ".swiper-button-prev",
    },
  });
}
